app/controllers/users_controller.rb

    def update
       @user = User.find(params[:id])
       @user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Michuuuuu"], ["email", "catus2@felinus.meow"], ["updated_at", "2021-02-08 23:26:37.902210"], ["id", 3]]

    def destroy
        User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]